This PR fixes the Managed Node Group unintended recreation. 

However, this also exposes that the aws-eks-terraform module has a bug how it handles Launch Templates. 

Given a Managed Node Group:

```hcl
  node_groups = {
    test-workers = {
      name                    = "${var.cluster_name}-test-workers"
      launch_template_id      = aws_launch_template.worker_beer.id
      launch_template_version = aws_launch_template.worker_beer.default_version
      # ..
   }
  }
```

This will instruct Terraform to create a single Launch Template `worker_beer` and a single Managed Node Group `clusteName-test-workers`:

```
  # aws_launch_template.worker_beer will be created
  + resource "aws_launch_template" "worker_beer" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Worker Launch-Template"
      + id                     = (known after apply)
      + instance_type          = "m5.large"
      + latest_version         = (known after apply)
      + name                   = "aws-eu-central-1-3-worker-beer"
      + tags                   = {
          + "NodeRole" = "worker"
        }
      + update_default_version = true
      # ... 
    }

  # module.eks.module.node_groups.aws_eks_node_group.workers["test-workers"] will be created
  + resource "aws_eks_node_group" "workers" {
      + ami_type        = (known after apply)
      + arn             = (known after apply)
      + capacity_type   = (known after apply)
      + cluster_name    = "aws-eu-central-1-3"
      + id              = (known after apply)
      + instance_types  = (known after apply)
      + node_group_name = "aws-eu-central-1-3-test-workers"
      + node_role_arn   = "arn:aws:iam::864348345328:role/aws-eu-central-1-32021010709125500060000000a"
      + version         = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      # ... 
    }
```

<img width="1596" alt="2021-01-20 at 14 58" src="https://user-images.githubusercontent.com/63895/105178662-01673c00-5b31-11eb-9464-2340af96c1b1.png">


What goes wrong is that after this Terraform is applied, AWS EKS has created a *second* Launch Template which is bound to the Worker Nodes of the Managed Node Group.

As a result, the creation of the Managed Node Group succeeds, but the updates later will fail, because the Worker Nodes are bound to the Launch Template created implicitly by EKS (*not* Terraform). 

Once the Launch Template has been modified, a newer version of the Launch Template is created. The problem is, that the nodes are bound to a wrong Launch Template! (the one created by EKS).

This issue was masked before, because the `random_pet` caused the Managed Node Group always be recreated when Launch Template got changed. Hence, the Managed Node Group was in "pristine" state after each "terraform apply". 

Now, when the Managed Node Group is _updated_ (instead of recreated) to use a newer version of the Launch Template, the 2..n attempts of "terraform apply" will fail because there exists an Launch Template created implicitly by EKS. 


## Userdata of Launch Template updated, Launch Template gets new version 
```hcl
Terraform will perform the following actions:

  # aws_launch_template.worker_beer will be updated in-place
  ~ resource "aws_launch_template" "worker_beer" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0fa87354118a95faa"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "aws-eu-central-1-3-worker-beer"
        tags                    = {
            "NodeRole" = "worker"
        }
      ~ user_data               = "original" -> "changed"
      # .. 
    }

  # module.eks.module.node_groups.aws_eks_node_group.workers["test-workers"] will be updated in-place
  ~ resource "aws_eks_node_group" "workers" {
        id              = "aws-eu-central-1-3:aws-eu-central-1-3-test-workers"
        tags            = {
            "NodeRole"                                     = "worker"
            "k8s.io/cluster-autoscaler/aws-eu-central-1-3" = "true"
            "k8s.io/cluster-autoscaler/enabled"            = "true"
        }

      ~ launch_template {
            id      = "lt-0fa87354118a95faa"
            name    = "aws-eu-central-1-3-worker-beer"
          ~ version = "1" -> (known after apply)
        }
      # .. 
    }
```

<img width="1887" alt="2021-01-20 at 15 06" src="https://user-images.githubusercontent.com/63895/105178897-4be8b880-5b31-11eb-9b3c-d87e7c536ffe.png">


TL;DR The existing behaviour of `random_pet` is indeed incorrect, but it only masks under itself a more serious bug about how the Launch Templates are currently handled.

